#pragma once
#include"fireW.h"

//зжЬхбљЪН
#define SIZE_FONT 25
#define STYLE_FONT "ЮЂШэбХКк"
#define COLOR_FONT WHITE
//ДАПкДѓаЁ
#define WINDOW_WIDTH 720
#define WINDOW_HEIGHT 580
//ааСа
#define  ROW 19
#define  COL 30
//ЗНЯђ
#define W_UP 0
#define W_DOWN 1
#define W_LEFT 2
#define W_RIGHT 3
//ЮЛжУ
int r = 16;
int c = 2;


enum {
	Пе,ЧН,Юв,ДВ,зР,УХ,УЧ,ЪЏ,ЦЦ,КЃ,
	ЫЎ,Яф,Аќ,Еч,Ъг,Р­,В№,Вё,РЫ,НИ,
	гу,іш,Щю,ЧГ,ВЈ,аЁ,ЙЋ,Ой,Уц,ЯТ,
	НЕ,СЫ,вЊ,ЧЎ,ВЛ,ъЇ,Уќ,ЬЋ,ЬВ,Ря,
	Яћ,ЯЂ,е§,дк,га,вЛ,БО,Аз,Ъщ,зю,
	ЕЦ,Йи,Ек,Ц№,ПД,бЬ,ЛЈ,АЩ,ЦЄ,Н№,
	Йт,
	C ,T ,R ,L ,S ,H ,I ,F ,ЃК,Дѓ
};

const char* text[] = {
	"  ","ЧН","Юв","ДВ","зР","УХ","УЧ","ЪЏ","ЦЦ","КЃ",
	"ЫЎ","Яф","Аќ","Еч","Ъг","Р­","В№","Вё","РЫ","НИ",
	"гу","іш","Щю","ЧГ","ВЈ","аЁ","ЙЋ","Ой","Уц","ЯТ",
	"НЕ","СЫ","вЊ","ЧЎ","ВЛ","ъЇ","Уќ","ЬЋ","ЬВ","Ря",
	"Яћ","ЯЂ","е§","дк","га","вЛ","БО","Аз","Ъщ","зю",
	"ЕЦ","Йи","Ек","Ц№","ПД","бЬ","ЛЈ","АЩ","ЦЄ","Н№",
	"Йт",
	"C ","T ","R ","L ","S ","H ","I ","F ","ЃК","Дѓ"
};

//Щю4 15
//Ъг12 5
//Аќ12 3
// КЃЦНУцЬЋЩюСЫ3 8
// ЙиЕЦ13 24
//ЕиЭМ
int map[ROW][COL] = {
	ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,вЛ,БО,Пе,ЧН,Пе,Ек,вЛ,Йи,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Щю,КЃ,Пе,Пе,Аз,Ъщ,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Щю,КЃ,Пе,гу,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,гу,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,НИ,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,ЪЏ,КЃ,Пе,Пе,гу,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,РЫ,КЃ,КЃ,КЃ,КЃ,КЃ,КЃ,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,Пе,Пе,Пе,НИ,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Яф,Аќ,Еч,Ъг,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,ЪЏ,КЃ,Пе,Аз,іш,Пе,Пе,ЧН,ЧН,ЧН,ЧН,УХ,ЧН,ЧН,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,ВЈ,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,зР,зР,зР,Пе,ЧН,Пе,Пе,Пе,Пе,КЃ,Пе,Дѓ,іш,Пе,Пе,ЧН,Пе,ЕЦ,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Пе,Пе,Пе,Пе,Пе,зР,Пе,зР,Пе,ЧН,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Йт,Пе,Пе,Пе,Пе,ЧН,
	ЧН,Пе,Юв,Пе,ДВ,Пе,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,Пе,Пе,КЃ,Пе,аЁ,іш,Пе,Пе,ЧН,Пе,Пе,аЁ,ЙЋ,Ой,Пе,ЧН,
	ЧН,ДВ,ДВ,ДВ,ДВ,Пе,Пе,Пе,Пе,Пе,Пе,УХ,Пе,Пе,Пе,Пе,КЃ,Пе,Пе,Пе,Пе,Пе,ЧН,Пе,Пе,ДВ,ДВ,ДВ,ДВ,ЧН,
	ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН,ЧН
};

int GamePlay();
int Move(int vr, int vc);