#pragma once
#include"fireW.h"

//字体样式
#define SIZE_FONT 25
#define STYLE_FONT "微软雅黑"
#define COLOR_FONT WHITE
//窗口大小
#define WINDOW_WIDTH 720
#define WINDOW_HEIGHT 580
//行列
#define  ROW 19
#define  COL 30
//方向
#define W_UP 0
#define W_DOWN 1
#define W_LEFT 2
#define W_RIGHT 3
//位置
int r = 16;
int c = 2;


enum {
	空,墙,我,床,桌,门,们,石,破,海,
	水,箱,包,电,视,拉,拆,柴,浪,礁,
	鱼,鲨,深,浅,波,小,公,举,面,下,
	降,了,要,钱,不,戋,命,太,滩,里,
	消,息,正,在,有,一,本,白,书,最,
	灯,关,第,起,看,烟,花,吧,皮,金,
	光,
	C ,T ,R ,L ,S ,H ,I ,F ,：,大
};

const char* text[] = {
	"  ","墙","我","床","桌","门","们","石","破","海",
	"水","箱","包","电","视","拉","拆","柴","浪","礁",
	"鱼","鲨","深","浅","波","小","公","举","面","下",
	"降","了","要","钱","不","戋","命","太","滩","里",
	"消","息","正","在","有","一","本","白","书","最",
	"灯","关","第","起","看","烟","花","吧","皮","金",
	"光",
	"C ","T ","R ","L ","S ","H ","I ","F ","：","大"
};

//深4 15
//视12 5
//包12 3
// 海平面太深了3 8
// 关灯13 24
//地图
int map[ROW][COL] = {
	墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,空,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,空,海,空,空,一,本,空,墙,空,第,一,关,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,深,海,空,空,白,书,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,空,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,深,海,空,鱼,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,空,海,空,空,空,鱼,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,礁,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,石,海,空,空,鱼,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,空,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,空,空,空,空,空,空,空,空,浪,海,海,海,海,海,海,墙,空,空,空,空,空,空,墙,
	墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,空,空,空,礁,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,箱,包,电,视,空,空,空,空,空,墙,空,空,空,石,海,空,白,鲨,空,空,墙,墙,墙,墙,门,墙,墙,墙,
	墙,空,空,空,空,空,空,空,空,空,空,墙,空,空,空,波,海,空,空,空,空,空,墙,空,空,空,空,空,空,墙,
	墙,空,空,空,空,空,空,桌,桌,桌,空,墙,空,空,空,空,海,空,大,鲨,空,空,墙,空,灯,空,空,空,空,墙,
	墙,空,空,空,空,空,空,桌,空,桌,空,墙,空,空,空,空,海,空,空,空,空,空,墙,空,光,空,空,空,空,墙,
	墙,空,我,空,床,空,空,空,空,空,空,墙,空,空,空,空,海,空,小,鲨,空,空,墙,空,空,小,公,举,空,墙,
	墙,床,床,床,床,空,空,空,空,空,空,门,空,空,空,空,海,空,空,空,空,空,墙,空,空,床,床,床,床,墙,
	墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙,墙
};

int GamePlay();
int Move(int vr, int vc);